package com.freeit.lesson2.basic;

/*
Задание 1

Набрать приведенный пример, откомпилировать его и запустить.
 */

public class Task1 {
    public static void main(String[] args) {
        System.out.println("Hello World!");
    }
}
